In [1]:
import numpy as np
import pandas as %pd

In [4]:
#1차원의 dictionaly
dic = {'red':[1,2,3], 'blue':[4,5,6],'black':[7,8,9]}

df = pd.DataFrame(dic)
df.index = ['one','two','three']
df

       red  blue  black
one      1     4      7
two      2     5      8
three    3     6      9

In [6]:
nestdict = {'red':{2012: 22, 2013: 33},
    'white':{2011: 13, 2012: 22, 2013: 16},
    'blue': {2011: 17, 2012: 27, 2013: 18}}
    
frame2 = pd.DataFrame(nestdict)
frame2

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

In [7]:
frame2.T

       2012  2013  2011
red    22.0  33.0   NaN
white  22.0  16.0  13.0
blue   27.0  18.0  17.0

In [8]:
ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [9]:
ser.index

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

In [10]:
ser.values

array([5, 0, 3, 8, 4], dtype=int64)

In [13]:
ser.idxmin(), ser.idxmax()

('blue', 'white')

In [14]:
frame2.index.is_unique

True

In [15]:
ser.index.is_unique

True

In [16]:
ser = pd.Series([2,5,7,4], index=['one','two','three','four'])
ser

one      2
two      5
three    7
four     4
dtype: int64

In [17]:
ser.reindex(['three','four','five','one'])

three    7.0
four     4.0
five     NaN
one      2.0
dtype: float64

In [18]:
ser = pd.Series(np.arange(4.), index=['red','blue','yellow','white'])

In [20]:
#yellow가 없어진 series를 보여주는 것, 원본은 유지된다.
ser.drop('yellow')

red      0.0
blue     1.0
white    3.0
dtype: float64

In [22]:
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [29]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [25]:
frame.drop(['blue','yellow'])

       ball  pen  pencil  paper
red       0    1       2      3
white    12   13      14     15

In [26]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [30]:
del frame['paper']
frame

        ball  pen  pencil
red        0    1       2
blue       4    5       6
yellow     8    9      10
white     12   13      14

In [31]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
    index=['red','blue','yellow','white'],
    columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [32]:
np.sqrt(frame) # sqrt는 자료구조의 원소마다 적용됨

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [33]:
frame.apply(lambda x: x.max()-x.min())

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [41]:
frame.apply(lambda s: pd.Series([s.mean(), s.std()], index=['mean','std']), axis=1)

        mean       std
red      1.5  1.290994
blue     5.5  1.290994
yellow   9.5  1.290994
white   13.5  1.290994

In [40]:
type(res)

pandas.core.frame.DataFrame

In [43]:
frame.sum(axis=1)

red        6
blue      22
yellow    38
white     54
dtype: int64

In [45]:
frame.mean(axis=1)

red        1.5
blue       5.5
yellow     9.5
white     13.5
dtype: float64

# 기술통계

In [48]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [49]:
#내림차순
ser.sort_index(ascending=False)

yellow    2.0
white     3.0
red       0.0
blue      1.0
dtype: float64

# 상관계수
* 양의 상관계수(0~1) : 정비례, 서로 상관관계가 존재하며 그 크기는 1,
* 음의 상관계수(-1~0) : 반비례 관계
* 공분산: 음,양 : 상관관계의 유무만 알 수 있다. 그 크기는 알 수 없다.

In [51]:
frame2 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],
    index=['red','blue','yellow','white'],
    columns=['ball','pen','pencil','paper'])
frame2

        ball  pen  pencil  paper
red        1    4       3      6
blue       4    5       6      1
yellow     3    3       1      5
white      4    1       6      4

In [52]:
frame2.corr()

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000

In [53]:
frame2.cov()

            ball       pen    pencil     paper
ball    2.000000 -0.666667  2.000000 -2.333333
pen    -0.666667  2.916667 -0.333333 -1.333333
pencil  2.000000 -0.333333  6.000000 -3.666667
paper  -2.333333 -1.333333 -3.666667  4.666667

# 데이터 체크

In [61]:
ser = pd.Series([0,1,2,np.NaN,9],
    index=['red','blue','yellow','white','green'])

In [65]:
#NaN 값을 지운다. 원본데이터 보존
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [63]:
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [64]:
ser.notnull()

red        True
blue       True
yellow     True
white     False
green      True
dtype: bool

In [66]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
    index = ['blue','green','red'],
    columns = ['ball','mug','pen'])

In [67]:
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [68]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [69]:
frame3.dropna(how='all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

In [71]:
#값이 없는 곳에 0으로 채워 넣어라.
frame3.fillna(0)

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  0.0  0.0
red     2.0  0.0  5.0

In [78]:
mser = pd.Series(np.random.rand(8),
    index=[['white','white','white','blue','blue','red','red',
 'red'], ['up','down','right','up','down','up','down','left']])
mser

white  up       0.723584
       down     0.990653
       right    0.548864
blue   up       0.845653
       down     0.276049
red    up       0.078214
       down     0.601796
       left     0.756369
dtype: float64

In [83]:
mser1 = pd.Series(np.random.rand(6),
                 index=[['one','two','two','three','three','three'],
                       [1,2,2,3,3,3]])
mser1

one    1    0.111835
two    2    0.616554
       2    0.419495
three  3    0.920341
       3    0.406762
       3    0.891217
dtype: float64

In [84]:
mser['white']

up       0.723584
down     0.990653
right    0.548864
dtype: float64

In [85]:
mser.unstack()

           down      left     right        up
blue   0.276049       NaN       NaN  0.845653
red    0.601796  0.756369       NaN  0.078214
white  0.990653       NaN  0.548864  0.723584

In [86]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [93]:
df=frame.stack()

In [88]:
mframe = pd.DataFrame(np.random.randn(16).reshape(4,4),
    index=[['white','white','red','red'], ['up','down','up','down']],
    columns=[['pen','pen','paper','paper'],[1,2,1,2]])

In [89]:
mframe

                 pen               paper
                   1         2         1         2
white up   -0.591415 -0.706416  0.212405 -0.033912
      down  0.495025 -0.866300  0.648615  0.537902
red   up    0.675971  0.332237  0.618276 -0.541073
      down  1.312122  0.719939 -0.909826 -1.062617

In [90]:
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']
mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up     -0.591415 -0.706416  0.212405 -0.033912
       down    0.495025 -0.866300  0.648615  0.537902
red    up      0.675971  0.332237  0.618276 -0.541073
       down    1.312122  0.719939 -0.909826 -1.062617

In [91]:
mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white  -0.591415 -0.706416  0.212405 -0.033912
down   white   0.495025 -0.866300  0.648615  0.537902
up     red     0.675971  0.332237  0.618276 -0.541073
down   red     1.312122  0.719939 -0.909826 -1.062617

In [149]:
df.to_csv('double_idx_test.csv')
print('성공')

성공

In [147]:
df = pd.DataFrame(np.random.random((8,3)),
            index=[['A','A','B','B','B','C','C','C'],
                  [1,2,3,4,5,6,7,8]],
            columns=['v1','v2','v3'])
df

           v1        v2        v3
A 1  0.353390  0.014220  0.406674
  2  0.398889  0.281669  0.865370
B 3  0.054638  0.520864  0.568714
  4  0.634402  0.028964  0.731720
  5  0.046497  0.640627  0.583798
C 6  0.339671  0.887235  0.243425
  7  0.608964  0.879414  0.727335
  8  0.964413  0.735877  0.184909

In [152]:
df.index_col.name = 'a','d'

AttributeError: 'DataFrame' object has no attribute 'index_col'

In [136]:
df

           v1        v2        v3
A 1  0.125397  0.799954  0.610738
  2  0.866793  0.171880  0.739354
B 3  0.116210  0.565453  0.447823
  4  0.832282  0.739886  0.274675
  5  0.062602  0.465058  0.249137
C 6  0.085399  0.439659  0.640586
  7  0.101949  0.609943  0.657475
  8  0.138082  0.481894  0.874880

In [150]:
read_data = pd.read_csv('double_idx_test.csv', index_col=[0,1])
read_data

           v1        v2        v3
A 1  0.353390  0.014220  0.406674
  2  0.398889  0.281669  0.865370
B 3  0.054638  0.520864  0.568714
  4  0.634402  0.028964  0.731720
  5  0.046497  0.640627  0.583798
C 6  0.339671  0.887235  0.243425
  7  0.608964  0.879414  0.727335
  8  0.964413  0.735877  0.184909

In [153]:
df = pd.DataFrame(np.arange(16).reshape(4,-1))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [154]:
df.to_csv('sample_df.csv')
print('sample_df.csv 저장 성공')

sample_df.csv 저장 성공

In [155]:
pd.read_csv('sample_df.csv', index_col=[0])

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [156]:
df.to_csv('no_index.csv', index = False)
print('인덱스 없이 파일에 저장 성공!')

인덱스 없이 파일에 저장 성공!

In [161]:
csvframe = pd.read_csv('ch05_01.txt')
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [171]:
pieces = pd.read_csv('ch05_01.txt', chunksize=2)

In [172]:
out = pd.Series(dtype=int)

In [173]:
for piece in pieces:
    out = pd.concat([out, pd.Series(piece['white'].sum())], ignore_index=True)
out

0    3
1    5
2    4
dtype: int64

In [175]:
frame = pd.DataFrame(np.arange(4).reshape(2,2))